<template>
 <div>
     <div class="container">
    <div class="box">
      <div class="d-flex justify-content-between">
        <h3 class="box-title">O'qituvchilar haqida malumot</h3>
        <input type="text" placeholder="Qidiruv..." class="input form-control" v-model="searchQuery" />
      </div>
      <table class="table table-hover table-bordered border-primary box-table">
        <thead>
          <tr>
            <th scope="col">Id</th>
            <th scope="col">Ism-Familya</th>
            <th scope="col">Lavozim</th>
            <th scope="col">Tug'ulgan yili</th>
            <th scope="col">Millati</th>
          </tr>
        </thead>
        <tbody v-for="malumot in filteredMalumotlar" :key="malumot.id">
          <tr>
            <th scope="row">{{malumot.id}}</th>
            <td>{{malumot.name}}</td>
            <td>{{malumot.more}}</td>
            <td>{{malumot.yil}}</td>
            <td>{{malumot.millat}}</td>
          </tr>
        </tbody>
      </table>
    </div>
  </div>

  <Footer />
 </div>
</template>

<script>
import Footer from "./Footer.vue"
export default {
    components:{
        Footer,
    },
  data() {
    return {
      searchQuery: "", // qidiruv so'rovini saqlash uchun ma'lumot
      malumotlar: [
        {
          id: 1,
          name: "Бўрибеков Эркинжон Шодмонович",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактаби директори",
          yil: "02.12.1971й Сирдарё вилояти",
          millat: "узбек"
        },
        {
          id: 2,
          name: "Рустамов Умиджон Пайзуллаевич",
          more: "УИБДУ ",
          yil: "11.12.1985йил Сирдарё вилояти, Боёвут тумани ",
          millat: "узбек"
        },
        {
          id: 3,
          name: "Акрамов Дилщод",
          more: "Боёвут туманидаги 10-умум таълим мактабининг ММИБДУ",
          yil: "09 .07.1989 йСирдарё вилояти, Боёвут тумани ",
          millat: "узбек"
        },
        {
          id: 4,
          name: "Миролимова  Манзура Эргашевна ",
          more: "Боёвут туманидаги 10-умум таълим мактабининг Кимё ўқитувчиси",
          yil: "10.11.1978й  Сирдарё вилояти, Боёвут тумани ",
          millat: "узбек"
        },
        {
          id: 5,
          name: "Умрзокова  Нилуфар Абидовна ",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактаби Кимё ўқитувчиси ",
          yil: "10.01.1981й  Сирдарё вилояти, Боёвут тумани ",
          millat: "узбек"
        },
        {
          id: 6,
          name: "Turayev Murtoz",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактаби ЧКБТ ўқитувчиси",
          yil: "Malumot yo'q",
          millat: "узбек"
        },
        {
          id: 7,
          name: "Назарова Комила ",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим бошлангич таълим ўқитувчиси  ",
          yil: "5.3.1978й Сирдарё вилояти, Боёвут тумани ",
          millat: "узбек"
        },
        {
          id: 8,
          name: "Нарзуллаев Акбар ",
          more: "таргиботчи",
          yil: "Malumot yo'q",
          millat: "узбек"
        },
        {
          id: 9,
          name: "Джулбекова Дилдора",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактаби ўқитувчиси",
          yil: "Malumot yo'q",
          millat: "узбек"
        },
        {
          id: 10,
          name: "Эргашов Охунжон",
          more:
            "Сирдарё вилояти Боёвут туманидги 10-умумий ўрта таълим мактабининг математика фани  ўқитувчиси ",
          yil: "14.10.1995	Сирдарё вилояти Боёвут тумани   ",
          millat: "узбек"
        },
        {
          id: 11,
          name: "Фармонова  Раъно ",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактаби Жисмоний тарбия фани ўқитувчиси лавозимида ишлайди",
          yil: "22.06.1996 й Сирдарё вилояти, Боёвут тумани",
          millat: "узбек"
        },
        {
          id: 12,
          name: "Мустафокулова Шарофат ",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактаби Она тили ва адабиёти фани укитувчиси   булиб  ишлайди ",
          yil: "06.11.1957 Сирдарё вилояти, Боёвут тумани ",
          millat: "узбек"
        },
        {
          id: 13,
          name: "Камбарова  Манзура",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактаби Инглиз тили ўқитувчиси  ",
          yil: "18.05.1982йил Сирдарё вилояти, Боёвут тумани ",
          millat: "узбек"
        },
        {
          id: 14,
          name: "Маманов  Усмонали  ",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактаби ўқитувчиси",
          yil: "Malumot yo'q",
          millat: "узбек"
        },
        {
          id: 15,
          name: "Жабборова  Рисқи",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактаби Рус тили укитувчиси лавозимида ишлайди ",
          yil:
            "10.10.1968 Тожикистон РеспубликасиЛенинобод вилояти Гончи тумани",
          millat: "Тожик"
        },
        {
          id: 16,
          name: "Хабибуллаева Мусаввара",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактабида тарих ўқитувчиси  ",
          yil: "3.10.1949 йил Сирдарё вилояти, Боёвут тумани ",
          millat: "узбек"
        },
        {
          id: 17,
          name: "Бобомуродова Насиба Мирзаюсуповна ",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактабида биология  фани ўқитувчиси  ",
          yil: "15.06.1969 й Сирдарё вилояти,Ховос тумани ",
          millat: "узбек"
        },
        {
          id: 18,
          name: "Сатторов Шерзод",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактаби амалий математика ва информатика   ўқитувчиси  ",
          yil: "22.11.1982йил  Сирдарё вилояти, Боёвут тумани ",
          millat: "узбек"
        },
        {
          id: 19,
          name: "Мустафокулов  Бахтиёр Абидкулович",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактабида Жисмоний тарбия фани укитувчиси  ",
          yil: "05.05.1989 йил Сирдарё вилояти Боёвут тумани ",
          millat: "узбек"
        },
        {
          id: 20,
          name: "Шойзоков Зиёдуло Абидович ",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактабида жисмоний тарбия ўқитувчиси ",
          yil: "29.09.1985 й Сирдарё вилояти, Боёвут тумани ",
          millat: "узбек"
        },
        {
          id: 21,
          name: "Назарова Наргиза Каримжоновна ",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактаби Бошланғич синф ўкитувчиси ",
          yil: "16.02.1974йd Сирдарё вилояти, Боёвут тумани ",
          millat: "узбек"
        },
        {
          id: 22,
          name: "Бобоева Фарида Саидбековна 	укитувчи		",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактабида Бошланғичсинф ўқитувчиси ",
          yil: "14.1.1975 йил Сирдарё вилояти, Боёвут тумани ",
          millat: "узбек"
        },
        {
          id: 23,
          name: "Бахромова Фатима Бердимуродовна ",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактабида бошлангич таълим ўқитувчи",
          yil: "1.01.1979 й  Сирдарё вилояти,Гулистон тумани ",
          millat: "узбек"
        },
        {
          id: 24,
          name: "Эркабоева Мунаввар Кодируллаевна ",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактабида Бошланғич таълим ўқитувчиси  ",
          yil: "8.07.1981 й Тошкент  вилояти,Бекобод тумани ",
          millat: "узбек"
        },
        {
          id: 25,
          name: "Зулхайдарова Дилдора Мирзаахмадовна ",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактаби Бошланғич синф ўқитувчиси",
          yil: "28 08 1979 йил Сирдарё вилояти, Боёвут тумани ",
          millat: "узбек"
        },
        {
          id: 26,
          name: "Холмуродова Рузигул Жумановна ",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактаби мехнат ўқитувчиси",
          yil: "07.10.1973й  Сирдарё вилояти, Боёвут тумани ",
          millat: "узбек"
        },
        {
          id: 27,
          name: "Туракулова Замира Файзиевна ",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактаби мехнат ўкитувчиси ",
          yil: "09.05.1969й Сирдарё вилояти, Боёвут тумани ",
          millat: "узбек"
        },
        {
          id: 28,
          name: "Турсунова Наргиза",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактабида мехнат  ўқитувчиси",
          yil: "29.10.1978 й Сирдарё вилояти, Гулистон  тумани ",
          millat: "узбек"
        },
        {
          id: 29,
          name: "Отабоева Раъно Сувонкуловна",
          more: "СирдарёвилоятиБоёвуттуманидаги 10-умумтаълиммактабидаукитувчи",
          yil: "11 01 1975 й Сирдарё вилояти, Боёвут тумани",
          millat: "узбек"
        },
        {
          id: 30,
          name: "Абдулазизов Мухиддин Урозбекович ",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактаби бошлангич   ўқитувчиси  ",
          yil: "07.06.1963йил Сирдарё вилояти, Боёвут тумани ",
          millat: "узбек"
        },
        {
          id: 31,
          name: "Корабоева Дилсўз ",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим ўзбек тили ва адабиёти   ўқитувчиси  ",
          yil: "20.05.1987 йил Тошкент вилояати Бекобод тумани ",
          millat: "узбек"
        },
        {
          id: 32,
          name: "Мавлянова Мўтабар ",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактабида Бошлангич синф ўқитувчиси",
          yil: "11.10.1984 й Тошкент вилояти Бекобод тумани",
          millat: "узбек"
        },
        {
          id: 33,
          name: "Хамрабоева  Мукаддас Вахобжоновна ",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактаби тасвирий санъат ва чизмачилик  ўкитувчиси  ",
          yil: "13 12 1988й Сирдарё вилояти, Боёвут тумани ",
          millat: "узбек"
        },
        {
          id: 34,
          name: "Эркабоева Лобар",
          more: "malumot yo'q",
          yil: "malumot yo'q",
          millat: "узбек"
        },
        {
          id: 35,
          name: "Мамараимова Гулчехра Базарбоевна ",
          more: "malumot yo'q",
          yil: "malumot yo'q",
          millat: "узбек"
        },
        {
          id: 36,
          name: "Хоникулов Дилшод",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умумтаълим мактабида жисмоний тарбия фани ўқитувчиси.",
          yil: "03.05. 1988 йил Сирдарё вилояти, Боёвут тумани ",
          millat: "узбек"
        },
        {
          id: 37,
          name: "Хонтураев Мирзабек",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактабида хукук ўқитувчиси ",
          yil: "15.10.1989 й Сирдарё вилояти, Боёвут тумани ",
          millat: "узбек"
        },
        {
          id: 38,
          name: "Эркабоева Саломат",
          more:
            "СирдарёвилоятиБоёвуттуманидаги 10-умумтаълиммактабидаБошлангич синф укитувчиси булиб ишлайди.  ",
          yil: "02.11.1985 йилСирдарёвилояти, Боёвут тумани",
          millat: "узбек"
        },
        {
          id: 39,
          name: "Тулиев Абдумажид  Бобоевич",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактабида физика фани укитувчиси ",
          yil: "13.10.1963й Сирдарё вилояти, Боёвут тумани ",
          millat: "узбек"
        },
        {
          id: 40,
          name: "Фармонова Ирода",
          more: "Malumot yo'q",
          yil: "Malumot yo'q",
          millat: "узбек"
        },
        {
          id: 41,
          name: "Бурибекова Назокат",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактабида бошланғич синф  ўқитувчиси  ",
          yil: "15.08.1981 й Сирдарё вилояти, Гулистон  тумани ",
          millat: "узбек"
        },
        {
          id: 42,
          name: "Амирбекова Саида",
          more:
            "Сирдарё вилояти Боёвут туманидаги  10-умумий ўрта таълим мактабида рус тили фани ўқитувчиси   ",
          yil: "31.05.2000й	Сирдарё вилояти, Боёвут  тумани",
          millat: "узбек"
        },
        {
          id: 43,
          name: "Собиркулова Дилбар",
          more: "Malumot yo'q",
          yil: "Malumot yo'q",
          millat: "узбек"
        },
        {
          id: 44,
          name: "Камбарова ГУлжахон",
          more:
            "Boyovut tuman xalq ta’limi bo’limiga qarashli 10-sonli umumiy o‘rta ta’lim maktabi  ingliz tili fani o ‘qituvchisi",
          yil: "05.08.1986	Jizzax viloyat  Paxtakor  tumani",
          millat: "узбек"
        },
        {
          id: 45,
          name: "Алматова  Раъно",
          more:
            "2016 йилдан  буён   Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактабида Она тили ва адабиёт фани укитувчиси вазифасида ишлайди .  ",
          yil: "16.10.1987.  йил  Сирдарё вилоти Боёвут тумани ",
          millat: "узбек"
        },
        {
          id: 46,
          name: "Исломова Шахноза",
          more:
            "Сирдарё вилояти Боёвут туманидаги 10-умум таълим мактабида она тили фани ўқитувчиси",
          yil: "30.08.1995 й  Сирдарё вилояти Боёвут тумани",
          millat: "узбек"
        },
        {
          id: 47,
          name: "Абдулхамидова Мадина",
          more: "Malumot yo'q",
          yil: "Malumot yo'q",
          millat: "узбек"
        },
        {
          id: 48,
          name: "Bozorboyev Ibrohim",
          more: "Malumot yo'q",
          yil: "Malumot yo'q",
          millat: "узбек"
        },
        {
          id: 49,
          name: "Шодмонова Гулзира ",
          more: "Malumot yo'q",
          yil: "Malumot yo'q",
          millat: "узбек"
        },
        {
          id: 50,
          name: " Jumanova Ezoza ",
          more: "Malumot yo'q",
          yil: "Malumot yo'q",
          millat: "узбек"
        },
        {
          id: 51,
          name: "Пардабоева Мунира",
          more: "Malumot yo'q",
          yil: "Malumot yo'q",
          millat: "узбек"
        }
      ]
    };
  },
  computed: {
    filteredMalumotlar() {
      // Qidiruvni amalga oshirish uchun filtrlangan malumotlar ro'yxatini hisoblash
      return this.malumotlar.filter(mal => {
        // Malumotlarni ism-familiyaga qarab filtrlash
        return mal.name
          .toLowerCase()
          .includes(this.searchQuery.toLowerCase());
      });
    }
  }
};
</script>

<style lang="css" scoped>
.box-table {
  margin-top: 50px;
  overflow-y:scroll ;
  max-height: 200px;
}
.box{
    margin-top: 50px;
}
.box-title{
    font-family: cursive;
}
.input{
    max-width: 220px;
}
@media only screen and (max-width: 800px) {
.box-title{
    font-family: cursive;
    font-size: 16px;
}
.box-table{
    max-width: 500px;
}
.input{
    max-width: 120px;
}

}
</style>
